In [1]:
import pandas as pd
import numpy as np

In [9]:
data={'Name of company':['Allied Signal','Bankers Trust','General Mills','ITT Industries','J.P.Morgan & Co.','Lehman Brothers','Marriott','MCI','Merrill Lynch','Microsoft','Morgan Stanley','Sun Microsystems','Travelers','US Airways','Warner-Lambert'],'Measure X':[24.23,25.53,25.41,24.14,29.62,28.25,25.81,24.39,40.26,32.95,91.36,25.99,39.42,26.71,35.00]}

In [10]:
df=pd.DataFrame(data,columns=['Name of company','Measure X'])

In [11]:
df

     Name of company  Measure X
0      Allied Signal      24.23
1      Bankers Trust      25.53
2      General Mills      25.41
3     ITT Industries      24.14
4   J.P.Morgan & Co.      29.62
5    Lehman Brothers      28.25
6           Marriott      25.81
7                MCI      24.39
8      Merrill Lynch      40.26
9          Microsoft      32.95
10    Morgan Stanley      91.36
11  Sun Microsystems      25.99
12         Travelers      39.42
13        US Airways      26.71
14    Warner-Lambert      35.00

In [12]:
df.mean()

Measure X    33.271333
dtype: float64

In [13]:
df.var()

Measure X    287.146612
dtype: float64

In [14]:
df.std()

Measure X    16.945401
dtype: float64

In [15]:
df.describe()

       Measure X
count  15.000000
mean   33.271333
std    16.945401
min    24.140000
25%    25.470000
50%    26.710000
75%    33.975000
max    91.360000

In [16]:
df.sort_values(by=['Measure X'],ascending=[True])

     Name of company  Measure X
3     ITT Industries      24.14
0      Allied Signal      24.23
7                MCI      24.39
2      General Mills      25.41
1      Bankers Trust      25.53
6           Marriott      25.81
11  Sun Microsystems      25.99
13        US Airways      26.71
5    Lehman Brothers      28.25
4   J.P.Morgan & Co.      29.62
9          Microsoft      32.95
14    Warner-Lambert      35.00
12         Travelers      39.42
8      Merrill Lynch      40.26
10    Morgan Stanley      91.36

In [17]:
Q1=np.percentile(df['Measure X'],25)
Q3=np.percentile(df['Measure X'],75)
IQR=Q3-Q1
lower_wesker=Q1-(1.5*IQR)
upper_wesker=Q3+(1.5*IQR)
upper_lim=df[df['Measure X']>upper_wesker]
lower_lim=df[df['Measure X']<lower_wesker]
outliers=[upper_lim,lower_lim]
outliers

[   Name of company  Measure X
 10  Morgan Stanley      91.36,
 Empty DataFrame
 Columns: [Name of company, Measure X]
 Index: []]

### Q. 4) Suppose that one in 200 long-distance telephone calls is misdirected. What is the probability that at least one in five attempted telephone calls reaches the wrong number? (Assume independence of attempts.)

In [18]:
'''p(misdirected call)=1/200
P(successive call)=1-(1/200)=0.995
Given each attempts are independent so
P(successive call after 5 attempt)=(0.9950)^5=0.975
p(misdirected call after 5 attempt)=1-0.975=0.025'''

'p(misdirected call)=1/200\nP(successive call)=1-(1/200)=0.995\nGiven each attempts are independent so\nP(successive call after 5 attempt)=(0.9950)^5=0.975\np(misdirected call after 5 attempt)=1-0.975=0.025'

### Q.5) 5.	Returns on a certain business venture, to the nearest  1,000, are known to follow the following probability distribution

In [7]:
X=[-2000,-1000,0,1000,2000,3000]
X=pd.DataFrame(X)

In [8]:
X

      0
0 -2000
1 -1000
2     0
3  1000
4  2000
5  3000

In [10]:
X.std()

0    1870.828693
dtype: float64

In [11]:
X.var()

0    3500000.0
dtype: float64